apache/nuttx/arch/arm/src/stm32/stm32f33xxx_adc.c
/****************************************************************************
 * arch/arm/src/stm32/stm32f33xxx_adc.c
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *
 *   based on stm32_adc.c
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <semaphore.h>
#include <errno.h>
#include <assert.h>
#include <debug.h>
#include <unistd.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>

#include "up_internal.h"
#include "up_arch.h"

#include "chip.h"
#include "stm32.h"
#include "stm32_dma.h"
#include "stm32_adc.h"

/* ADC "upper half" support must be enabled */

#ifdef CONFIG_STM32_ADC

/* Some ADC peripheral must be enabled */

#if defined(CONFIG_STM32_ADC1) || defined(CONFIG_STM32_ADC2)

/* This implementation is for the STM32F33XXX only.
 *
 * STM32F33XXX chips are intended for digital power conversion applications,
 * which casue some differences in use comapred to the standard STM32 ADC driver.
 * This include:
 *   - lower half ADC driver can be used not only with the upper-half ADC driver,
 *     but also as the lower-half logic for the power-related drivers (eg. SMPS
 *     upper driver),
 *   - ADC will be used in time-critical operations (eg. converter control loop),
 *     therfore it is necessary to support the high performecne, zero latency ADC
 *     interrupts
 *   - ADC triggering from the high resolution timer (HRTIM) and external lines
 *   - support for injected sequence
 */

#if defined(CONFIG_STM32_STM32F33XX)

#warning "ADC support for STM32F33XX under development !"

/* HRTIM triggering needs DMA support */

#if defined(ADC_HAVE_HRTIM) && !defined(ADC_HAVE_DMA)
#  error "ADC HRTIM Triggering support only with DMA"
#endif

#ifdef ADC_HAVE_INJECTED
#  error "ADC injected trigger not implemented yet"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
/* RCC reset ****************************************************************/

#define STM32_RCC_RSTR   STM32_RCC_AHBRSTR
#define RCC_RSTR_ADC1RST RCC_AHBRSTR_ADC12RST
#define RCC_RSTR_ADC2RST RCC_AHBRSTR_ADC12RST

/* ADC interrupts ***********************************************************/

#define STM32_ADC_DMAREG_OFFSET    STM32_ADC_CFGR_OFFSET
#define ADC_DMAREG_DMA             ADC_CFGR_DMAEN
#define STM32_ADC_EXTREG_OFFSET    STM32_ADC_CFGR_OFFSET
#define ADC_EXTREG_EXTSEL_MASK     ADC_CFGR_EXTSEL_MASK
#define ADC_EXTREG_EXTEN_MASK      ADC_CFGR_EXTEN_MASK
#define ADC_EXTREG_EXTEN_DEFAULT   ADC_CFGR_EXTEN_RISING
#define STM32_ADC_JEXTREG_OFFSET   STM32_ADC_JSQR_OFFSET
#define ADC_JEXTREG_JEXTSEL_MASK   ADC_JSQR_JEXTSEL_MASK
#define ADC_JEXTREG_JEXTEN_MASK    ADC_JSQR_JEXTEN_MASK
#define ADC_JEXTREG_JEXTEN_DEFAULT ADC_JSQR_JEXTEN_RISING

#define ADC_ISR_EOC                ADC_INT_EOC
#define ADC_IER_EOC                ADC_INT_EOC
#define ADC_ISR_AWD                ADC_INT_AWD1
#define ADC_IER_AWD                ADC_INT_AWD1
#define ADC_ISR_JEOC               ADC_INT_JEOC
#define ADC_IER_JEOC               ADC_INT_JEOC
#define ADC_ISR_OVR                ADC_INT_OVR
#define ADC_IER_OVR                ADC_INT_OVR

#define ADC_ISR_ALLINTS (ADC_ISR_EOC | ADC_ISR_AWD | ADC_ISR_JEOC | \
                         ADC_ISR_OVR)
#define ADC_IER_ALLINTS (ADC_IER_EOC | ADC_IER_AWD | ADC_IER_JEOC | \
                         ADC_IER_OVR)

/* ADC Channels/DMA ********************************************************/
/* The maximum number of channels that can be sampled.  If DMA support is
 * not enabled, then only a single channel can be sampled.  Otherwise,
 * data overruns would occur.
 */

#define ADC_MAX_CHANNELS_DMA   16
#define ADC_MAX_CHANNELS_NODMA 1

#ifdef ADC_HAVE_DMA
#  define ADC_REG_MAX_SAMPLES ADC_MAX_CHANNELS_DMA
#else
#  define ADC_REG_MAX_SAMPLES ADC_MAX_CHANNELS_NODMA
#endif

#define ADC_INJ_MAX_SAMPLES   4

#define ADC_DMA_CONTROL_WORD (DMA_CCR_MSIZE_16BITS | \
                              DMA_CCR_PSIZE_16BITS | \
                              DMA_CCR_MINC |         \
                              DMA_CCR_CIRC)

#if defined(ADC_HAVE_DMA) || (ADC_REG_MAX_SAMPLES == 1)
#  define ADC_SMPR_DEFAULT    ADC_SMPR_61p5
#else /* Slow down sampling frequency */
#  define ADC_SMPR_DEFAULT    ADC_SMPR_601p5
#endif

#ifndef ADC1_SMP1
#  define ADC1_SMP1 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP2
#  define ADC1_SMP2 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP3
#  define ADC1_SMP3 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP4
#  define ADC1_SMP4 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP5
#  define ADC1_SMP5 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP6
#  define ADC1_SMP6 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP7
#  define ADC1_SMP7 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP8
#  define ADC1_SMP8 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP9
#  define ADC1_SMP9 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP10
#  define ADC1_SMP10 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP11
#  define ADC1_SMP11 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP12
#  define ADC1_SMP12 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP13
#  define ADC1_SMP13 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP14
#  define ADC1_SMP14 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP15
#  define ADC1_SMP15 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP16
#  define ADC1_SMP16 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP17
#  define ADC1_SMP17 ADC_SMPR_DEFAULT
#endif
#ifndef ADC1_SMP18
#  define ADC1_SMP18 ADC_SMPR_DEFAULT
#endif

#ifndef ADC2_SMP1
#  define ADC2_SMP1 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP2
#  define ADC2_SMP2 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP3
#  define ADC2_SMP3 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP4
#  define ADC2_SMP4 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP5
#  define ADC2_SMP5 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP6
#  define ADC2_SMP6 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP7
#  define ADC2_SMP7 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP8
#  define ADC2_SMP8 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP9
#  define ADC2_SMP9 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP10
#  define ADC2_SMP10 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP11
#  define ADC2_SMP11 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP12
#  define ADC2_SMP12 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP13
#  define ADC2_SMP13 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP14
#  define ADC2_SMP14 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP15
#  define ADC2_SMP15 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP16
#  define ADC2_SMP16 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP17
#  define ADC2_SMP17 ADC_SMPR_DEFAULT
#endif
#ifndef ADC2_SMP18
#  define ADC2_SMP18 ADC_SMPR_DEFAULT
#endif

