apache/nuttx/arch/arm/src/stm32/stm32f33xxx_adc.c
#define ADC1_SMPR1   ((ADC1_SMP1 << ADC_SMPR1_SMP1_SHIFT) |  \
                      (ADC1_SMP2 << ADC_SMPR1_SMP2_SHIFT) |  \
                      (ADC1_SMP3 << ADC_SMPR1_SMP3_SHIFT) |  \
                      (ADC1_SMP4 << ADC_SMPR1_SMP4_SHIFT) |  \
                      (ADC1_SMP5 << ADC_SMPR1_SMP5_SHIFT) |  \
                      (ADC1_SMP6 << ADC_SMPR1_SMP6_SHIFT) |  \
                      (ADC1_SMP7 << ADC_SMPR1_SMP7_SHIFT) |  \
                      (ADC1_SMP8 << ADC_SMPR1_SMP8_SHIFT) |  \
                      (ADC1_SMP9 << ADC_SMPR1_SMP9_SHIFT))
#define ADC1_SMPR2   ((ADC1_SMP10 << ADC_SMPR2_SMP10_SHIFT) | \
                      (ADC1_SMP11 << ADC_SMPR2_SMP11_SHIFT) | \
                      (ADC1_SMP12 << ADC_SMPR2_SMP12_SHIFT) | \
                      (ADC1_SMP13 << ADC_SMPR2_SMP13_SHIFT) | \
                      (ADC1_SMP14 << ADC_SMPR2_SMP14_SHIFT) | \
                      (ADC1_SMP15 << ADC_SMPR2_SMP15_SHIFT) | \
                      (ADC1_SMP16 << ADC_SMPR2_SMP16_SHIFT) | \
                      (ADC1_SMP17 << ADC_SMPR2_SMP17_SHIFT) | \
                      (ADC1_SMP18 << ADC_SMPR2_SMP18_SHIFT))

#define ADC2_SMPR1   ((ADC2_SMP1 << ADC_SMPR1_SMP1_SHIFT) | \
                      (ADC2_SMP2 << ADC_SMPR1_SMP2_SHIFT) | \
                      (ADC2_SMP3 << ADC_SMPR1_SMP3_SHIFT) | \
                      (ADC2_SMP4 << ADC_SMPR1_SMP4_SHIFT) | \
                      (ADC2_SMP5 << ADC_SMPR1_SMP5_SHIFT) | \
                      (ADC2_SMP6 << ADC_SMPR1_SMP6_SHIFT) | \
                      (ADC2_SMP7 << ADC_SMPR1_SMP7_SHIFT) | \
                      (ADC2_SMP8 << ADC_SMPR1_SMP8_SHIFT) | \
                      (ADC2_SMP9 << ADC_SMPR1_SMP9_SHIFT))
#define ADC2_SMPR2   ((ADC2_SMP10 << ADC_SMPR2_SMP10_SHIFT) | \
                      (ADC2_SMP11 << ADC_SMPR2_SMP11_SHIFT) | \
                      (ADC2_SMP12 << ADC_SMPR2_SMP12_SHIFT) | \
                      (ADC2_SMP13 << ADC_SMPR2_SMP13_SHIFT) | \
                      (ADC2_SMP14 << ADC_SMPR2_SMP14_SHIFT) | \
                      (ADC2_SMP15 << ADC_SMPR2_SMP15_SHIFT) | \
                      (ADC2_SMP16 << ADC_SMPR2_SMP16_SHIFT) | \
                      (ADC2_SMP17 << ADC_SMPR2_SMP17_SHIFT) | \
                      (ADC2_SMP18 << ADC_SMPR2_SMP18_SHIFT))

/* Last bit of the extsel fields indicate if external trigger is in use */

#define HAVE_EXTSEL_MASK  (1<<8)

#if defined(ADC1_HAVE_TIMER) || defined(ADC1_HAVE_HRTIM) || defined(ADC1_HAVE_EXTI)
#  define ADC1_HAVE_EXTSEL 1
#else
#  undef ADC1_HAVE_EXTSEL
#endif

#if defined(ADC2_HAVE_TIMER) || defined(ADC2_HAVE_HRTIM) || defined(ADC2_HAVE_EXTI)
#  define ADC2_HAVE_EXTSEL 1
#else
#  undef ADC2_HAVE_EXTSEL
#endif

#if defined(ADC1_HAVE_EXTSEL) || defined(ADC2_HAVE_EXTSEL)
#  define ADC_HAVE_EXTSEL
#endif

#if defined(ADC1_HAVE_JEXTSEL) || defined(ADC2_HAVE_JEXTSEL)
#  define ADC_HAVE_JEXTSEL
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the state of one ADC block */

struct stm32_dev_s
{
  FAR const struct adc_callback_s *cb;
#ifndef CONFIG_STM32_ADC_NOIRQ
  uint8_t irq;          /* Interrupt generated by this ADC block */
#endif
  uint8_t nchannels;    /* Number of channels */
  uint8_t cr_channels;  /* Number of configured regular channels */
  uint8_t cj_channels;  /* Number of configured injected channels */
  uint8_t intf;         /* ADC interface number */
  uint8_t current;      /* Current ADC channel being converted */
#ifdef ADC_HAVE_DMA
  uint8_t dmachan;      /* DMA channel needed by this ADC */
  bool    hasdma;       /* True: This channel supports DMA */
#endif
#ifdef ADC_HAVE_TIMER
  uint8_t trigger;      /* Timer trigger channel: 0=CC1, 1=CC2, 2=CC3,
                         * 3=CC4, 4=TRGO */
#endif
#ifndef CONFIG_STM32_ADC_NOIRQ
  xcpt_t   isr;         /* Interrupt handler for this ADC block */
#endif
  uint32_t base;        /* Base address of registers unique to this ADC
                         * block */
  uint32_t smp1;        /* Sample time part 1 */
  uint32_t smp2;        /* Sample time part 2 */
#ifdef ADC_HAVE_EXTSEL
  uint32_t extsel;      /* EXTSEL value used by this ADC block */
#endif
#ifdef ADC_HAVE_JEXTSEL
  uint32_t jextsel;     /* JEXTSEL value used by this ADC block */
#endif
#ifdef ADC_HAVE_TIMER
  uint32_t tbase;       /* Base address of timer used by this ADC block */
  uint32_t pclck;       /* The PCLK frequency that drives this timer */
  uint32_t freq;        /* The desired frequency of conversions */
#endif
#ifdef ADC_HAVE_DMA
  DMA_HANDLE dma;       /* Allocated DMA channel */

  /* DMA transfer buffer for regular channels */

  uint16_t r_dmabuffer[ADC_REG_MAX_SAMPLES];

#  ifdef ADC_HAVE_INJECTED
  /* DMA transfer buffer for injected channels */

  uint16_t j_dmabuffer[ADC_INJ_MAX_SAMPLES];
#  endif
#endif

  /* List of selected ADC regular channels to sample */

  uint8_t  r_chanlist[ADC_REG_MAX_SAMPLES];

#ifdef ADC_HAVE_INJECTED
  /* List of selected ADC injected channels to sample */

  uint8_t  j_chanlist[ADC_INJ_MAX_SAMPLES];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* ADC Register access */

static void stm32_modifyreg32(unsigned int addr, uint32_t clrbits,
                              uint32_t setbits);
static uint32_t adc_getreg(FAR struct stm32_dev_s *priv, int offset);
static void     adc_putreg(FAR struct stm32_dev_s *priv, int offset,
                           uint32_t value);
static void     adc_modifyreg(FAR struct stm32_dev_s *priv, int offset,
                              uint32_t clrbits, uint32_t setbits);
#ifdef ADC_HAVE_TIMER
static uint16_t tim_getreg(FAR struct stm32_dev_s *priv, int offset);
static void     tim_putreg(FAR struct stm32_dev_s *priv, int offset,
                           uint16_t value);
static void     tim_modifyreg(FAR struct stm32_dev_s *priv, int offset,
                              uint16_t clrbits, uint16_t setbits);
static void     tim_dumpregs(FAR struct stm32_dev_s *priv,
                             FAR const char *msg);
#endif

static void adc_rccreset(FAR struct stm32_dev_s *priv, bool reset);

